//#define _CRT_SECURE_NO_WARNINGS
//#include<stdio.h>
///*
//指针 - 地址
//1.内存是如何编号的？
//2.一个这样的内存单元是多大空间？
//32位 - 32根地址线 - 物理线 - 通电 - 1/0
//64位 ……
//
//电信号转换成数字信息：1和0组成的二进制序列
//
//00000000000000000000000000000000
//...
//01111111111111111111111111111111
//10000000000000000000000000000000
//....
//11111111111111111111111111111111
//
//2的32次方个内存单元
//假设一个内存单元是1bit
//则
//4,294,967,296bit
///8=536,870,912byte
///1024=524,288KB
///1024＝512MB
///1024=0.5GB
//
//64位就是1GB
//
//
//char - 1byte = 8bit - 8个地址（太细了）
//
//通过平衡后，最终一个内存单元是一个字节（1 Byte）
//*/
//
////int main() {
////
////	int a = 10;//a在内存中要分配的空间 - 4个字节
////	printf("%p\n",a);
////	printf("%p\n",&a);//&p 专门用来打印地址的
////	int* pa = &a;//pa是用来存放地址的，在C语言pa中是指针变量
////	//* 说明pa是指针变量
////	//int 说明pa指向的对象是int类型的 指向a的首地址
////
////	char ch = 'w';
////	char* pa = &ch;
////	return 0;
////}
//
////指针 就是 地址
//
////int main() {
////
////	int a = 10;
////	int* pa = &a;
////
////	*pa = 20;//*解引用操作 *pa就是通过pa里边的地址，找到a
////
////	printf("%d\n",a);
////
////	return 0;
////}
//
//int main() {
//
//	printf("%d\n",sizeof(char*));//指针大小4字节 - 32位平台  8字节 - 64位平台
//	printf("%d\n",sizeof(short*));//4
//	printf("%d\n",sizeof(int*));//4
//	printf("%d\n",sizeof(long *));//4
//	printf("%d\n",sizeof(long long*));//4
//	printf("%d\n",sizeof(float*));//4
//	printf("%d\n",sizeof(double*));//4
//	/*
//	指针的大小是相同的！
//	为什么
//	because指针是用来存放地址的！
//	指针需要多大空间，取决于地址的存储需要多大空间
//
//	32位 32bit - 4byte
//	64位 64bit - 8byte
//	*/
//	return 0;
//}